#1) შექმენით ფუნქცია სახელად add რომელსაც ექნება ორი პარამეტრი, სახელად num1 num2, ამ პარამეტრებმ,ა უნდა მიიღოს რიცხვები და ფუნქციამ უნდა დაბეჭდოს ამ ორი რიცხვის ჯამი
def add (num1, num2):
    print(num1 + num2)

add(2, 6)


"""2)შექმენით ფუნქცია რომელსაც გადაეცემა 2 რიცხვი.
   ამ ფუნქციას უნდა დაარქვათ calculate. უნდა დაბეჭდოთ
     რომელი ოპრეაციის არჩევა შეუძლია მომხმარებელს და შემდეგ 
     უნდა ჩაატაროთ ის ოპერაცია იმ ორ რიცხვს შორის რომელიც 
     მომხმარებელმა შემოიყვანა"""

# def calculate (numm1, numm2):
    