function countingSort(arr) {
    if (arr.length === 0) return [];

    let min = Math.min(...arr);
    let max = Math.max(...arr);

    let count = new Array(max - min + 1).fill(0);
    let output = new Array(arr.length);

    for (let i = 0; i < arr.length; i++) {
        count[arr[i] - min]++;
    }

    for (let i = 1; i < count.length; i++) {
        count[i] += count[i - 1];
    }

    for (let i = arr.length - 1; i >= 0; i--) {
        let index = arr[i] - min;
        output[count[index] - 1] = arr[i];
        count[index]--;
    }

    return output;
}



// ზედაპირულად გაეცანით პარაგრაგ 11.2 counting & radix სორტზე, გაანალიზეთ რა განსხვავებაა შედარების და დათვლის სორტირების ალგორითმებში

// რა არის და როგორ მუშაობს Counting sort (time complexity - o(n+k)): 
// Counting Sort არის სორტირების ალგორითმი, რომელიც ითვლის თითოეული მნიშვნელობის სიხშირეს,
// შემდეგ ქმნის ჯამს (prefix sum), და ამ ინფორმაციის გამოყენებით ანაწილებს ელემენტებს საბოლოო პოზიციებზე.
// ითვლის სიხშირეებს
// ქმნის prefix sum-ს
// ათავსებს ელემენტებს სწორ პოზიციაზე


// გადაუყვება მასივს და ითვლის თითოეული მნიშვნელობის სიხშირეს, ამ სიხშირეებს გარდაქმნის prefix sum-ად
//  prefix sum-ის გამოყენებით ადგენს თითოეული ელემენტის სწორ პოზიციას და ქმნის ახალ დალაგებულ მასივს

// რა არის Radix Sort (time complexity - O(d * (n + k))): 
// Radix Sort მუშაობს ციფრებზე, ჯერ ალაგებს ერთეულებით, შემდეგ ათეულებით, შემდეგ ასეულებით.



// რა განსხვავებაა შედარების და დათვლის სორტირების ალგორითმებში?
// შედარების ალგორითმი ყოველ ჯერზე ადარებს ელემენტებს მეტია თუ ნაკლებია,ასევე აქ არის მინიმუმი, ქვედა ზღვარი o(n log n) 
// უარეს შემთხვევაში ამაზე სწრაფი ვერ იქნება. სჭირდება შედარებით ნაკლები მეხსიერება 
// დათვლის სორიტირების ალგორითმში დათვლა საერთოდ არ ხდება
// აქ უბრალოდ ვამოწმებთ რამდენჯერ გვხვდება კონკრეტული მნიშვნელობა. თუმცა მუშაობს შეზღუდული რაოდენობის მასივებზე,
// და range-ის შესაბამისად მოითხოვს მეტ მეხსიერებას, დამოკიდებულია range-ის სიდიდეზე.