#დავპრინტოთ არითმეტიკული მოქმედებები რიცხვებს შორის, (+, -, *, /) 
print(5 + 9)
print(8 - 2)
print(4 * 3)
print(24 / 6)

# ორი ტექსტური მონაცემი შევაერთე და მივიღე სახელი და გვარი - გიორგი შავძე/giorgi shavadze
print("giorgi" + " " + "shavadze")

#ძალით დავუშვი შეცდომა, ტექსტური მონაცემი ბრწყალების გარეშე დავწერე რაზეც ტერმინალზე(1) Error აჩვენა. 
#print(giorgi+ " " + shavadze)

#(1)ტერმინალი არის ფანჯარა სადაც გამოდის ჩვენს მიერ დაწერილი ბრძანებების შედეგები.

#არითმეტიკული ქმედება ორ ცვლადს შორის.
age = 16
height = 174
print(age + height)


